SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG26/Include/efr32bg26_prs_signals.h
/** Synchronous signals and sources combined and aligned with register bit fields: */
#define PRS_SYNC_TIMER0_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER0UF)
#define PRS_SYNC_TIMER0_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER0OF)
#define PRS_SYNC_TIMER0_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC0)
#define PRS_SYNC_TIMER0_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC1)
#define PRS_SYNC_TIMER0_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC2)
#define PRS_SYNC_TIMER1_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER1UF)
#define PRS_SYNC_TIMER1_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER1OF)
#define PRS_SYNC_TIMER1_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC0)
#define PRS_SYNC_TIMER1_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC1)
#define PRS_SYNC_TIMER1_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC2)
#define PRS_SYNC_IADC0_SCAN_ENTRY_DONE                     (PRS_SYNC_CH_CTRL_SOURCESEL_IADC0 | PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANENTRYDONE)
#define PRS_SYNC_IADC0_SCAN_TABLE_DONE                     (PRS_SYNC_CH_CTRL_SOURCESEL_IADC0 | PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANTABLEDONE)
#define PRS_SYNC_IADC0_SINGLE_DONE                         (PRS_SYNC_CH_CTRL_SOURCESEL_IADC0 | PRS_SYNC_CH_CTRL_SIGSEL_IADC0SINGLEDONE)
#define PRS_SYNC_TIMER2_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER2UF)
#define PRS_SYNC_TIMER2_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER2OF)
#define PRS_SYNC_TIMER2_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC0)
#define PRS_SYNC_TIMER2_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC1)
#define PRS_SYNC_TIMER2_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC2)
#define PRS_SYNC_TIMER3_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER3UF)
#define PRS_SYNC_TIMER3_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER3OF)
#define PRS_SYNC_TIMER3_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC0)
#define PRS_SYNC_TIMER3_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC1)
#define PRS_SYNC_TIMER3_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC2)
#define PRS_SYNC_TIMER4_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER4UF)
#define PRS_SYNC_TIMER4_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER4OF)
#define PRS_SYNC_TIMER4_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC0)
#define PRS_SYNC_TIMER4_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC1)
#define PRS_SYNC_TIMER4_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC2)
#define PRS_SYNC_VDAC0_CH0_DONE_SYNC                       (PRS_SYNC_CH_CTRL_SOURCESEL_VDAC0 | PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH0DONESYNC)
#define PRS_SYNC_VDAC0_CH1_DONE_SYNC                       (PRS_SYNC_CH_CTRL_SOURCESEL_VDAC0 | PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH1DONESYNC)
#define PRS_SYNC_VDAC1_CH0_DONE_SYNC                       (PRS_SYNC_CH_CTRL_SOURCESEL_VDAC1 | PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH0DONESYNC)
#define PRS_SYNC_VDAC1_CH1_DONE_SYNC                       (PRS_SYNC_CH_CTRL_SOURCESEL_VDAC1 | PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH1DONESYNC)
#define PRS_SYNC_TIMER5_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER5UF)
#define PRS_SYNC_TIMER5_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER5OF)
#define PRS_SYNC_TIMER5_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC0)
#define PRS_SYNC_TIMER5_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC1)
#define PRS_SYNC_TIMER5_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC2)
#define PRS_SYNC_TIMER6_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER6UF)
#define PRS_SYNC_TIMER6_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER6OF)
#define PRS_SYNC_TIMER6_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC0)
#define PRS_SYNC_TIMER6_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC1)
#define PRS_SYNC_TIMER6_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC2)
#define PRS_SYNC_TIMER7_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER7UF)
#define PRS_SYNC_TIMER7_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER7OF)
#define PRS_SYNC_TIMER7_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC0)
#define PRS_SYNC_TIMER7_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC1)
#define PRS_SYNC_TIMER7_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC2)
#define PRS_SYNC_TIMER8_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER8UF)
#define PRS_SYNC_TIMER8_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER8OF)
#define PRS_SYNC_TIMER8_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC0)
#define PRS_SYNC_TIMER8_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC1)
#define PRS_SYNC_TIMER8_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC2)
#define PRS_SYNC_TIMER9_UF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER9UF)
#define PRS_SYNC_TIMER9_OF                                 (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER9OF)
#define PRS_SYNC_TIMER9_CC0                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC0)
#define PRS_SYNC_TIMER9_CC1                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC1)
#define PRS_SYNC_TIMER9_CC2                                (PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9 | PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC2)

/** Asynchronous signal sources enumeration: */
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_NONE                  (0x00000000UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_IADC0                 (0x00000001UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_LETIMER0              (0x00000002UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_BURTC                 (0x00000003UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO                  (0x00000004UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_CMUL                  (0x00000005UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_CMU                   (0x00000006UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_CMUH                  (0x00000007UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL                  (0x00000008UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_PRS                   (0x00000009UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_ACMP0                 (0x0000000aUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_ACMP1                 (0x0000000bUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_PCNT0                 (0x0000000cUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_SYSRTC0               (0x0000000dUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0L                (0x0000000eUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0                 (0x0000000fUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART0L              (0x00000010UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART0               (0x00000011UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC0L                (0x00000012UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC0                 (0x00000013UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L                (0x00000014UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1                 (0x00000015UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_LCD                   (0x00000016UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EMUL                  (0x00000017UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EMU                   (0x00000018UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO                 (0x00000019UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_HFRCOEM23             (0x0000001aUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_USART0                (0x00000020UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0                (0x00000021UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1                (0x00000022UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2                (0x00000023UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3                (0x00000024UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_CORE                  (0x00000025UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_AGCL                  (0x00000026UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_AGC                   (0x00000027UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_BUFC                  (0x00000028UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_MODEML                (0x00000029UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_MODEM                 (0x0000002aUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_MODEMH                (0x0000002bUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_FRC                   (0x0000002cUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_PROTIMERL             (0x0000002dUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_PROTIMER              (0x0000002eUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_SYNTH                 (0x0000002fUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_RACL                  (0x00000030UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_RAC                   (0x00000031UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4                (0x00000032UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART1L              (0x00000033UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART1               (0x00000034UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5                (0x00000035UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6                (0x00000036UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7                (0x00000037UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8                (0x00000038UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9                (0x00000039UL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_USART1                (0x0000003aUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_USART2                (0x0000003bUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2               (0x0000003cUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3               (0x0000003dUL)
#define _PRS_ASYNC_CH_CTRL_SOURCESEL_HFRCO0                (0x0000003eUL)

/** Asynchronous signal sources enumeration aligned with register bit field: */
#define PRS_ASYNC_CH_CTRL_SOURCESEL_NONE                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_NONE << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_USART0                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_IADC0                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_IADC0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_LETIMER0               (_PRS_ASYNC_CH_CTRL_SOURCESEL_LETIMER0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_BURTC                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_BURTC << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_CORE                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_CORE << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_CMUL                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_CMUL << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_CMU                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_CMU << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_CMUH                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_CMUH << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_AGCL                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_AGCL << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_AGC                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_AGC << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_BUFC                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_BUFC << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_MODEML                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_MODEML << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_MODEM                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_MODEM << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_MODEMH                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_MODEMH << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_FRC                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_FRC << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_PROTIMERL              (_PRS_ASYNC_CH_CTRL_SOURCESEL_PROTIMERL << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_PROTIMER               (_PRS_ASYNC_CH_CTRL_SOURCESEL_PROTIMER << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_SYNTH                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_SYNTH << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_PRS                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_PRS << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_RACL                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_RACL << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_RAC                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_RAC << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_ACMP0                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_ACMP0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_ACMP1                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_ACMP1 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_PCNT0                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_PCNT0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_SYSRTC0                (_PRS_ASYNC_CH_CTRL_SOURCESEL_SYSRTC0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0L                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0L << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART0L               (_PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART0L << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART0                (_PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART1L               (_PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART1L << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART1                (_PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART1 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC0L                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC0L << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC0                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1L << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_VDAC1 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER5 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER6 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER7 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER8 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER9 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_USART1                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_USART2                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_USART2 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2                (_PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART2 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3                (_PRS_ASYNC_CH_CTRL_SOURCESEL_EUSART3 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_LCD                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_LCD << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_HFRCO0                 (_PRS_ASYNC_CH_CTRL_SOURCESEL_HFRCO0 << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EMUL                   (_PRS_ASYNC_CH_CTRL_SOURCESEL_EMUL << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_EMU                    (_PRS_ASYNC_CH_CTRL_SOURCESEL_EMU << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO                  (_PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO << 8)
#define PRS_ASYNC_CH_CTRL_SOURCESEL_HFRCOEM23              (_PRS_ASYNC_CH_CTRL_SOURCESEL_HFRCOEM23 << 8)

